{
    "hello": "Hello! How can I assist you today?",
    "hi": "Hi there! What do you need help with?",
    "help": "I'm here to help! What topic are you struggling with?",
    "homework": {
        "math": "What specific math problem are you working on?",
        "science": "What science topic do you need help with?",
        "history": "Which historical event or topic are you studying?",
        "literature": "What book or author do you need help with?"
    },
    "math": {
        "addition": "To add two numbers, simply combine them. For example, 2 + 3 = 5.",
        "subtraction": "Subtraction is taking one number away from another. For example, 5 - 2 = 3.",
        "multiplication": "Multiplication is repeated addition. For example, 4 * 3 = 12.",
        "division": "Division is splitting into equal parts. For example, 12 / 3 = 4."
    },
    "science": {
        "gravity": "Gravity is a force that pulls objects toward each other. The Earth’s gravity pulls us down.",
        "photosynthesis": "Photosynthesis is the process by which plants use sunlight to convert CO2 and water into glucose.",
        "atoms": "Atoms are the basic building blocks of matter, consisting of protons, neutrons, and electrons."
    },
    "history": {
        "world war 2": "World War II was a global conflict from 1939 to 1945 involving most of the world's nations.",
        "ancient rome": "Ancient Rome was a civilization that ruled much of Europe and the Mediterranean from 27 BC to AD 476.",
        "the renaissance": "The Renaissance was a period of cultural revival in Europe from the 14th to the 17th century."
    },
    "literature": {
        "shakespeare": "William Shakespeare was a playwright known for works like 'Romeo and Juliet' and 'Hamlet.'",
        "to kill a mockingbird": "'To Kill a Mockingbird' is a novel by Harper Lee that deals with serious issues like racism and injustice.",
        "1984": "'1984' by George Orwell is a dystopian novel that explores themes of surveillance and totalitarianism."
    },
    "default": "I'm sorry, I don't understand that. Can you please rephrase your question?",
    "goodbye": "Goodbye! If you have more questions, feel free to ask anytime!",
  "pussy": "do you want to see scarlet pussy?",
  "send me a image": "https://raw.githubusercontent.com/scarlet888/json/refs/heads/main/Scarlet.webp"
}
